saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/AnalogDevices.ADuCM36x_DFP.1.0.3.pdsc
	</devices>
	<!-- boards section (mandatory for Board Support Packs) -->
	<boards>
		<board vendor="Analog Devices" name="EVAL-ADuCM360MKZ" revision="Rev. B" orderForm="http://www.analog.com/en/processors-dsp/analog-microcontrOLlers/aducm360/products/EVAL-ADUCM360/eb.html">
			<description>Analog Devices ADuCM360 Evaluation Kit</description>
			<image small="Images/EVAL-ADuCM360MKZ_small.jpg" large="Images/EVAL-ADuCM360MKZ.jpg"/>
			<book category="setup"         name="Documents/UG-457.pdf" title="ADuCM360 Development Systems Getting Started Tutorial"/>
			<book category="schematic"     name="Documents/ADuCM360_361_board_outline.pdf"   title="Layout"/>
			<book category="schematic"     name="Documents/ADuCM360_361_schematic.PDF"      title="Schematic"/>
			<mountedDevice    deviceIndex="0" Dvendor="Analog Devices:1" Dname="ADuCM360"/>
			<debugInterface adapter="J-Link Lite ADI" connector="Mini-USB"/>
			<feature type="USB"       n="1"              name="Mini-USB connector for Debugger, Power and UART "/>
			<feature type="XTAL"      n="32768"/>
			<feature type="DIO"       n="19"             name="Digital IO"/>
			<feature type="AIO"       n="11"             name="Analog inputs to ADC"/>
			<feature type="AIO"       n="1"              name="VDAC Outputs"/>
			<feature type="Button"    n="1"              name="Reset Push-Button"/>
			<feature type="LED"       n="2"              name="Red Display LED and Green power LED"/>
		</board>
		<board vendor="Analog Devices" name="EVAL-ADuCM362QSPZ" revision="Rev. B" orderForm="http://www.analog.com/en/processors-dsp/analog-microcontrOLlers/aducm362/products/EVAL-ADUCM362/eb.html">
			<description>Analog Devices ADuCM360 Evaluation Kit</description>
			<image small="Images/EVAL-ADuCM362QSPZ_small.jpg" large="Images/EVAL-ADuCM362QSPZ.jpg"/>
			<book category="schematic"     name="Documents/ADuCM362_363_board_outline.pdf"   title="Layout"/>
			<book category="schematic"     name="Documents/ADuCM362_363_schematic.PDF"      title="Schematic"/>
			<mountedDevice    deviceIndex="0" Dvendor="Analog Devices:1" Dname="ADuCM362"/>
			<debugInterface adapter="J-Link Lite ADI" connector="Mini-USB"/>
			<feature type="USB"       n="1"              name="Mini-USB connector for Debugger, Power and UART "/>
			<feature type="XTAL"      n="32768"/>
			<feature type="DIO"       n="19"             name="Digital IO"/>
			<feature type="AIO"       n="11"             name="Analog inputs to ADC"/>
			<feature type="AIO"       n="1"              name="VDAC Outputs"/>
			<feature type="Button"    n="1"              name="Reset Push-Button"/>
			<feature type="LED"       n="2"              name="Red Display LED and Green power LED"/>
		</board>
	</boards>
	<!-- examples section (optional for all Software Packs)-->
	<examples>
		<example name="Blinky_360" doc="README.txt" folder="Examples/Blinky" version="1.0.3">
			<description>Blinky ADuCM360 example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="cces" load="cces/.project"/>
				<environment name="uv" load="keil/Blinky.uvprojx"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Getting Started</category>
			</attributes>
		</example>
		<example name="RTX_Blinky_360" doc="README.txt" folder="Examples/RTX_Blinky" version="1.0.3">
			<description>Simple RTX Kernel based example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/Blinky.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/RTX_Blinky.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Getting Started</category>
			</attributes>
		</example>
		<example name="Blinky_362" doc="README.txt" folder="Examples/Blinky_362" version="1.0.3">
			<description>Blinky ADuCM362 example</description>
			<board name="EVAL-ADuCM362QSPZ" vendor="Analog Devices"/>
			<project>
				<environment name="cces" load="cces/.project"/>
				<environment name="uv" load="keil/Blinky_362.uvprojx"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Getting Started</category>
			</attributes>
		</example>
		<!-- Basic driver examples -->
		<example name="ADC" doc="README.txt" folder="Examples/ADC" version="1.0.3">
			<description>ADC example, including UART example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/AdcExample.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/AdcExample.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>ADC</keyword>
			</attributes>
		</example>
		<example name="ADC_DMA" doc="README.txt" folder="Examples/ADC_DMA" version="1.0.3">
			<description>ADC_DMA example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/ADC_DMA.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/ADC_DMA.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>ADC_DMA</keyword>
			</attributes>
		</example>
		<example name="AN1159 I2C" doc="README.txt" folder="Examples/AN1159 I2C" version="1.0.3">
			<description>AN1159 I2C example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/I2C.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/I2C.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Board Examples</category>
				<keyword>I2C</keyword>
			</attributes>
		</example>
		<example name="DAC_DMA" doc="README.txt" folder="Examples/DAC_DMA" version="1.0.3">
			<description>DAC_DMA example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/DAC_DMA.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/DAC_DMA.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>DAC_DMA</keyword>
			</attributes>
		</example>
		<example name="Flash" doc="README.txt" folder="Examples/Flash" version="1.0.3">
			<description>Flash example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/Flash.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/Flash.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>Flash</keyword>
			</attributes>
		</example>
		<example name="FlashProtect" doc="README.txt" folder="Examples/FlashProtect" version="1.0.3">
			<description>FlashProtect example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/FlashProtect.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/FlashProtect.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<category>Driver Examples</category>
				<keyword>FlashProtect</keyword>
			</attributes>
		</example>
		<example name="I2C_DMA Master" doc="README.txt" folder="Examples/I2C_DMA/Master" version="1.0.3">
			<description>I2C_DMA Master example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/I2C_Master.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/I2CDMA_Master.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>I2C_Master</keyword>
			</attributes>
		</example>
		<example name="I2C_DMA Slave" doc="README.txt" folder="Examples/I2C_DMA/Slave" version="1.0.3">
			<description>I2C_DMA Slave example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/I2C_Slave.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/I2CDMA_Slave.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>I2C_Slave</keyword>
			</attributes>
		</example>
		<example name="PowerDown" doc="README.txt" folder="Examples/PowerDown" version="1.0.3">
			<description>PowerDown example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/PowerDown.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/PowerDown.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>PowerDown</keyword>
			</attributes>
		</example>
		<example name="PWM" doc="README.txt" folder="Examples/PWM" version="1.0.3">
			<description>PWM example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/PWM.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/PWM.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>PWM</keyword>
			</attributes>
		</example>
		<example name="RTD_Demo" doc="README.txt" folder="Examples/RTD_Demo" version="1.0.3">
			<description>RTD_Demo example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/RTD_Demo.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/RTD_Demo.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>RTD_Demo</keyword>
			</attributes>
		</example>
		<example name="SPI" doc="README.txt" folder="Examples/SPI" version="1.0.3">
			<description>SPI example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/SPI.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/SPI.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>SPI</keyword>
			</attributes>
		</example>
		<example name="SPI DMA Master" doc="README.txt" folder="Examples/SPI_DMA/SPIDMA_Master" version="1.0.3">
			<description>SPI DMA Master example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/SPIDMA_Master.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/SPIDMA_Master.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>SPIDMA_Master</keyword>
			</attributes>
		</example>
		<example name="SPI DMA Slave" doc="README.txt" folder="Examples/SPI_DMA/SPIDMA_Slave" version="1.0.3">
			<description>SPI DMA Slave example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/SPIDMA_Slave.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/SPIDMA_Slave.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>SPIDMA_Slave</keyword>
			</attributes>
		</example>
		<example name="Timers" doc="README.txt" folder="Examples/Timers" version="1.0.3">
			<description>Timers example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/Timers.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/Timers.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>Timers</keyword>
			</attributes>
		</example>
		<example name="Uart_DMA" doc="README.txt" folder="Examples/Uart_DMA" version="1.0.3">
			<description>Uart_DMA example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/UARTDma_demo.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/UARTDMA.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>Uart_DMA</keyword>
			</attributes>
		</example>
		<example name="SysTick" doc="README.txt" folder="Examples/SysTick" version="1.0.3">
			<description>SysTick timer example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/SysTick.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/SysTick.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>SysTick</keyword>
			</attributes>
		</example>
		<example name="I2CBasic_Master" doc="README.txt" folder="Examples/I2C_Basic/Master" version="1.0.3">
			<description>I2CBasic Master example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/I2CBasic_Master.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/I2CBasic_Master.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>I2CBasic_Master</keyword>
			</attributes>
		</example>
		<example name="I2CBasic_Slave" doc="README.txt" folder="Examples/I2C_Basic/Slave" version="1.0.3">
			<description>I2CBasic Slave example</description>
			<board name="EVAL-ADuCM360MKZ" vendor="Analog Devices"/>
			<project>
				<environment name="uv" load="keil/I2CBasic_Slave.uvprojx"/>
				<environment name="cces" load="cces/.project"/>
				<environment name="iar" load="iar/I2CBasic_Slave.ewp"/>
			</project>
			<attributes>
				<component Cclass="CMSIS" Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<category>Driver Examples</category>
				<keyword>I2CBasic_Slave</keyword>
			</attributes>
		</example>
	</examples>
	<conditions>
		<condition id="ARMCC">
			<require Tcompiler="ARMCC" />
		</condition>
		<condition id="GCC">
			<require Tcompiler="GCC" />
		</condition>
		<condition id="IAR">
			<require Tcompiler="IAR"/>
		</condition>
		<condition id="ADuCM360">
			<description>ADuCM360 device</description>
			<require Dvendor="Analog Devices:1"/>
			<require Dname="ADuCM360"/>
		</condition>
		<condition id="ADuCM360_ARM">
			<description>ADuCM360 device</description>
			<require condition="ADuCM360"/>
			<require Tcompiler="ARMCC"/>
		</condition>
		<condition id="ADuCM360_GCC">
			<description>ADuCM360 GCC</description>
			<require condition="ADuCM360"/>
			<require condition="GCC"/>
		</condition>
		<condition id="ADuCM360_IAR">
			<description>ADuCM360 device</description>
			<require condition="ADuCM360"/>
			<require Tcompiler="IAR"/>
		</condition>
